common/system/include/constants
L 1;
H_INTERFACE 0.5;
H 1;